BookLoanCA/test/StartBookLoan/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="BookLoanCA">
  <soapenv:Body>
    <book:Book>
      <bookid>1</bookid>
      <customerid>1</customerid>
    </book:Book>
  </soapenv:Body>
</soapenv:Envelope>